dmatking/idf-new/boards/cyd/cyd28_ili9341_touch/sdkconfig.defaults
# Target: ESP32-WROOM-32E (classic ESP32)
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Console — UART0
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000
